 

#Область ОбработчикиСобытийЭлементовШапкиФормы
// zzz
// Обработчик нажатия на кнопку "Загрузить".
//
Процедура КнопкаЗагрузитьНажатие(Элемент)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = НСтр("ru='Выберите внешнюю обработку дополнения'");
	Диалог.МножественныйВыбор = Ложь;
	
	Если Диалог.Выбрать() Тогда
		ПутьДополнения = Диалог.ПолноеИмяФайла;
		ДанныеДополнения = Новый ДвоичныеДанные(ПутьДополнения);
		Содержание = Новый ХранилищеЗначения(ДанныеДополнения);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик нажатия на кнопку "Сохранить".
//
Процедура КнопкаСохранитьНажатие(Элемент)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = НСтр("ru='Выберите внешнюю обработку для сохранения дополнения'");
	Диалог.МножественныйВыбор = Ложь;
	
	Если Диалог.Выбрать() Тогда
		ПутьДополнения = Диалог.ПолноеИмяФайла;
		ДанныеДополнения = Содержание.Получить();
		ДанныеДополнения.Записать(ПутьДополнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
